sercankuslu/astromonty/trunk/Programms/PIC18F97J60_test/TCPIP Demo App/MainDemo.c
	// Get proper values for the validation structure indicating that we can use 
	// these EEPROM/Flash contents on future boot ups
	NVMValidationStruct.wOriginalChecksum = wOriginalAppConfigChecksum;
	NVMValidationStruct.wCurrentChecksum = CalcIPChecksum((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));
	NVMValidationStruct.wConfigurationLength = sizeof(APP_CONFIG);

	// Write the validation struct and current AppConfig contents to EEPROM/Flash
	#if defined(EEPROM_CS_TRIS)
	    XEEBeginWrite(0x0000);
	    XEEWriteArray((BYTE*)&NVMValidationStruct, sizeof(NVMValidationStruct));
		XEEWriteArray((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));
    #else
		SPIFlashBeginWrite(0x0000);
		SPIFlashWriteArray((BYTE*)&NVMValidationStruct, sizeof(NVMValidationStruct));
		SPIFlashWriteArray((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));
    #endif
}
#endif
static void UpdateKey(KEYS_STR * K)
{
    BYTE i;
    BYTE j;		
    static BYTE a = 0;
    static BYTE b = 0;
    static BYTE k = 0;
    static const DWORD TIME_PERIOD = TICK_SECOND/10;
    static BOOL Init = 0;
    DWORD CurrTime;
    CurrTime = TickGet();
    if(!Init){
        CKeys.TIMEOUT_up    = 0;
        CKeys.TIMEOUT_down  = 0;
        CKeys.TIMEOUT_left  = 0;
        CKeys.TIMEOUT_right = 0;
        CKeys.TIMEOUT_esc   = 0;
        CKeys.TIMEOUT_enter = 0;
        CKeys.Scan.Val = 0;
        CKeys.Pressed.Val = 0;
        Init = 1;
    }
    
    TRISBbits.TRISB1 = 1;
    TRISBbits.TRISB2 = 1;
    TRISBbits.TRISB3 = 1;
    TRISBbits.TRISB4 = 1;
    TRISDbits.TRISD0 = 0;
    TRISDbits.TRISD1 = 0;
    TRISDbits.TRISD2 = 0;
    TRISBbits.TRISB5 = 0;
    LATD = 0;
	LATBbits.LATB1 = 0;
	LATBbits.LATB2 = 0;
	LATBbits.LATB3 = 0;
	LATBbits.LATB4 = 0;
	LATBbits.LATB5 = 0;
	
	LATDbits.LATD0 = 1; // перва€ строка (menu и enter)
	Nop();Nop();
	CKeys.Scan.keys.esc = PORTBbits.RB1^0x01;
	CKeys.Scan.keys.enter = PORTBbits.RB3^0x01;	
	LATDbits.LATD0 = 0; // перва€ строка (menu и enter)	
	Nop();
	LATDbits.LATD1 = 1; // перва€ строка (menu и enter)
	Nop();Nop();
	CKeys.Scan.keys.left = PORTBbits.RB1;
	CKeys.Scan.keys.right = PORTBbits.RB2;	
	CKeys.Scan.keys.up = PORTBbits.RB3;
	CKeys.Scan.keys.down = PORTBbits.RB4;	
	LATDbits.LATD1 = 0; // перва€ строка (menu и enter)	
	Nop();
	// нажали-обь€вили-таймаут-ждем отпускани€-отпустили-таймаут-ждем нажати€
	if(CurrTime > CKeys.TIMEOUT_up){
    	// ждем таймаут
    	if(CKeys.Scan.keys.up){
        	// если кнопка нажата
        	if(!CKeys.Pressed.keys.up){
        	    // если она не была нажата
        	    CKeys.Pressed.keys.up = 1; // нажимаем и ждем таймаут 
        	    CKeys.TIMEOUT_up = CurrTime + TIME_PERIOD;
        	    K->keys.up = 1;           // сообщаем о нажатии
        	}
    	} else {
    	    // если отпущена
        	if(CKeys.Pressed.keys.up){
            	// если она была нажата
            	CKeys.Pressed.keys.up = 0; // отпускаем и ждем таймаут
            	CKeys.TIMEOUT_up = CurrTime + TIME_PERIOD;
            	K->keys.up = 0;
        	} 
    	}
	}
	if(CurrTime > CKeys.TIMEOUT_down){
    	// ждем таймаут
    	if(CKeys.Scan.keys.down){
        	// если кнопка нажата
        	if(!CKeys.Pressed.keys.down){
        	    // если она не была нажата
        	    CKeys.Pressed.keys.down = 1; // нажимаем и ждем таймаут 
        	    CKeys.TIMEOUT_down = CurrTime + TIME_PERIOD;
        	    K->keys.down = 1;           // сообщаем о нажатии
        	}
    	} else {
    	    // если отпущена
        	if(CKeys.Pressed.keys.down){
            	// если она была нажата
            	CKeys.Pressed.keys.down = 0; // отпускаем и ждем таймаут
            	CKeys.TIMEOUT_down = CurrTime + TIME_PERIOD;
            	K->keys.down = 0;
        	} 
    	}
	}
	if(CurrTime > CKeys.TIMEOUT_left){
    	// ждем таймаут
    	if(CKeys.Scan.keys.left){
        	// если кнопка нажата
        	if(!CKeys.Pressed.keys.left){
        	    // если она не была нажата
        	    CKeys.Pressed.keys.left = 1; // нажимаем и ждем таймаут 
        	    CKeys.TIMEOUT_left = CurrTime + TIME_PERIOD;
        	    K->keys.left = 1;           // сообщаем о нажатии
        	}
    	} else {
    	    // если отпущена
        	if(CKeys.Pressed.keys.left){
            	// если она была нажата
            	CKeys.Pressed.keys.left = 0; // отпускаем и ждем таймаут
            	CKeys.TIMEOUT_left = CurrTime + TIME_PERIOD;
            	K->keys.left = 0;
        	} 
    	}
	}
	if(CurrTime > CKeys.TIMEOUT_right){
    	// ждем таймаут
    	if(CKeys.Scan.keys.right){
        	// если кнопка нажата
        	if(!CKeys.Pressed.keys.right){
        	    // если она не была нажата
        	    CKeys.Pressed.keys.right = 1; // нажимаем и ждем таймаут 
        	    CKeys.TIMEOUT_right = CurrTime + TIME_PERIOD;
        	    K->keys.right = 1;           // сообщаем о нажатии
        	}
    	} else {
    	    // если отпущена
        	if(CKeys.Pressed.keys.right){
            	// если она была нажата
            	CKeys.Pressed.keys.right = 0; // отпускаем и ждем таймаут
            	CKeys.TIMEOUT_right = CurrTime + TIME_PERIOD;
            	K->keys.right = 0;
        	} 
    	}
	}
	if(CurrTime > CKeys.TIMEOUT_esc){
    	// ждем таймаут
    	if(CKeys.Scan.keys.esc){
        	// если кнопка нажата
        	if(!CKeys.Pressed.keys.esc){
        	    // если она не была нажата
        	    CKeys.Pressed.keys.esc = 1; // нажимаем и ждем таймаут 
        	    CKeys.TIMEOUT_esc = CurrTime + TIME_PERIOD;
        	    K->keys.esc = 1;           // сообщаем о нажатии
        	}
    	} else {
    	    // если отпущена
        	if(CKeys.Pressed.keys.esc){
            	// если она была нажата
            	CKeys.Pressed.keys.esc = 0; // отпускаем и ждем таймаут
            	CKeys.TIMEOUT_esc = CurrTime + TIME_PERIOD;
            	K->keys.esc = 0;
        	} 
    	}
	}
	if(CurrTime > CKeys.TIMEOUT_enter){
    	// ждем таймаут
    	if(CKeys.Scan.keys.enter){
        	// если кнопка нажата
        	if(!CKeys.Pressed.keys.enter){
        	    // если она не была нажата
        	    CKeys.Pressed.keys.enter = 1; // нажимаем и ждем таймаут 
        	    CKeys.TIMEOUT_enter = CurrTime + TIME_PERIOD;
        	    K->keys.enter = 1;           // сообщаем о нажатии
        	}
    	} else {
    	    // если отпущена
        	if(CKeys.Pressed.keys.enter){
            	// если она была нажата
            	CKeys.Pressed.keys.enter = 0; // отпускаем и ждем таймаут
            	CKeys.TIMEOUT_enter = CurrTime + TIME_PERIOD;
            	K->keys.enter = 0;
        	} 
    	}
	}
}
static void InitTimerAndPWM(void)
{
	//CCP5
	char period=0x00;
    unsigned char outputconfig=0;
    unsigned char outputmode=0;
    unsigned char config=0;
    unsigned int duty_cycle=0;
    //Timer0
    unsigned char config0=0x00;
    unsigned int timer0_value=0x00;
    //Timer1    
    unsigned char config1=0x00;
    unsigned int timer1_value=0x00;
    //Timer2    
    unsigned char config2=0x00;
    unsigned int timer2_value=0x00;
    //----Configure Timer1----
    //timer1_value = 0x00;    
    //WriteTimer1(timer1_value);            //clear timer if previously contains any value
        
    //config1 =  TIMER_INT_ON|T1_16BIT_RW|T1_SOURCE_INT|T1_PS_1_8|T1_OSC1EN_OFF|T1_SYNC_EXT_OFF;
    //OpenTimer1(config1);                //API configures the tmer1 as per user defined parameters
    //IPR1bits.TMR1IP = 0; // HIGH
    //PIR1bits.TMR1IF = 0; 
    //PIE1bits.TMR1IE = 1;
    
    //----Configure Timer2----
    timer2_value = 0x00;    
    WriteTimer2(timer2_value);            //clear timer if previously contains any value

    config2 =  T2_POST_1_16 | T2_PS_1_16 | TIMER_INT_OFF;
    OpenTimer2(config2);                //API configures the tmer1 as per user defined parameters

    SetTmrCCPSrc(T12_SOURCE_CCP);
    PIE1bits.TMR2IE = 0;
    //----Configure pwm ----
    period = 0xFF;
    OpenPWM5( period);            //Configure PWM module and initialize PWM period

    //-----set duty cycle----
    duty_cycle = 0x0F00;
    SetDCPWM5(duty_cycle);        //set the duty cycle
}
